---
kind: type
id: T:Autodesk.Revit.UI.RibbonButtonOptions
source: html/aead4050-04ae-c55e-b6a3-7c2aec99c8b6.htm
---
# Autodesk.Revit.UI.RibbonButtonOptions

A utility class containing the Revit.ini options settings related to ribbon buttons

## Syntax (C#)
```csharp
public class RibbonButtonOptions : IDisposable
```